In [57]:
import pandas as pd
df = pd.read_csv('rz3.csv',sep=',',encoding='utf8')
df

     num price year month date
0    0 123 159 2016 1 2016/6/1
1    1 124 753 2016 2 2016/6/2
2    2 125 456 2016 3 2016/6/3
3    3 126 852 2016 4 2016/6/4
4    4 127 210 2016 5 2016/6/5
5    5 115 299 2016 6 2016/6/6
6    6 102 699 2016 7 2016/6/7
7    7 201 599 2016 8 2016/6/8
8    8 154 199 2016 9 2016/6/9
9  9 142 899 2016 10 2016/6/10

In [58]:
df = pd.read_csv('rz3.csv',delim_whitespace=True,encoding='utf8')
df

   num  price  year  month       date
0  123    159  2016      1   2016/6/1
1  124    753  2016      2   2016/6/2
2  125    456  2016      3   2016/6/3
3  126    852  2016      4   2016/6/4
4  127    210  2016      5   2016/6/5
5  115    299  2016      6   2016/6/6
6  102    699  2016      7   2016/6/7
7  201    599  2016      8   2016/6/8
8  154    199  2016      9   2016/6/9
9  142    899  2016     10  2016/6/10

In [59]:
df.price.describe()

count     10.000000
mean     512.500000
std      284.462944
min      159.000000
25%      232.250000
50%      527.500000
75%      739.500000
max      899.000000
Name: price, dtype: float64

In [60]:
df.num.max()

201

In [61]:
df.price.mean()

512.5

In [62]:
df.num.std()

27.39201018951005

In [63]:
import numpy as np
from pandas import read_excel
df = read_excel('rz4.xls')
df

,Unnamed: 0,School Num,Class,Sex,Name,English,Physics,Military,Maths,Algebra,Geometry,Computer
0,0,2308024241,23080242,M,"Chen, Long",76,78,77,40,23,60,89
1,1,2308024244,23080242,F,"Zhou, Yi",66,91,75,47,47,44,82
2,2,2308024251,23080242,M,Zhang， Bo,85,81,75,45,45,60,80
3,3,2308024249,23080242,M,"Zhu, Hao",65,50,80,72,62,71,82
4,4,2308024219,23080242,F,"Feng, Yin",73,88,92,61,47,46,83
5,5,2308024201,23080242,M,"Chi, Pei",60,50,89,71,76,71,82
6,6,2308024347,23080243,F,"Li, Hua",67,61,84,61,65,78,83
7,7,2308024307,23080243,M,"Chen, Ten",76,79,86,69,40,69,82
8,8,2308024226,23080243,M,"Yu, Hao",66,67,85,65,61,71,95
9,9,2308024220,23080243,F,"Li, Jia",62,60,90,60,67,7,95
10,10,2308024242,23080243,M,"Li, Shang Chu",76,90,84,60,66,60,82
11,11,2308024210,23080243,F,"Guo, Yi",79,67,84,64,64,79,85
12,12,2308024435,23080244,M,"Jiang, Yi Tao",77,71,71,87,61,73,76
13,13,2308024432,23080244,M,"Zhao, Yu",74,74,74,88,68,70,71
14,14,2308024446,23080244,F,"Zhou, Lu",76,80,77,61,74,80,85
15,15,2308024421,23080244,M,"Lin, Jian Xian",73,72,81,63,90,75,85
16,16,2308024433,23080244,M,"Li, Da Qiang",79,76,77,78,70,70,89
17,17,2308024428,23080244,M,"Li, Che Tong",64,96,91,69,60,77,83
18,18,2308024402,23080244,F,"Wang, hui",73,74,93,70,71,75,88
19,19,2308024422,23080244,M,"Li, Xiao Liang",85,60,85,72,72,83,89

In [64]:
del df["Unnamed: 0"]
df

,School Num,Class,Sex,Name,English,Physics,Military,Maths,Algebra,Geometry,Computer
0,2308024241,23080242,M,"Chen, Long",76,78,77,40,23,60,89
1,2308024244,23080242,F,"Zhou, Yi",66,91,75,47,47,44,82
2,2308024251,23080242,M,Zhang， Bo,85,81,75,45,45,60,80
3,2308024249,23080242,M,"Zhu, Hao",65,50,80,72,62,71,82
4,2308024219,23080242,F,"Feng, Yin",73,88,92,61,47,46,83
5,2308024201,23080242,M,"Chi, Pei",60,50,89,71,76,71,82
6,2308024347,23080243,F,"Li, Hua",67,61,84,61,65,78,83
7,2308024307,23080243,M,"Chen, Ten",76,79,86,69,40,69,82
8,2308024226,23080243,M,"Yu, Hao",66,67,85,65,61,71,95
9,2308024220,23080243,F,"Li, Jia",62,60,90,60,67,7,95
10,2308024242,23080243,M,"Li, Shang Chu",76,90,84,60,66,60,82
11,2308024210,23080243,F,"Guo, Yi",79,67,84,64,64,79,85
12,2308024435,23080244,M,"Jiang, Yi Tao",77,71,71,87,61,73,76
13,2308024432,23080244,M,"Zhao, Yu",74,74,74,88,68,70,71
14,2308024446,23080244,F,"Zhou, Lu",76,80,77,61,74,80,85
15,2308024421,23080244,M,"Lin, Jian Xian",73,72,81,63,90,75,85
16,2308024433,23080244,M,"Li, Da Qiang",79,76,77,78,70,70,89
17,2308024428,23080244,M,"Li, Che Tong",64,96,91,69,60,77,83
18,2308024402,23080244,F,"Wang, hui",73,74,93,70,71,75,88
19,2308024422,23080244,M,"Li, Xiao Liang",85,60,85,72,72,83,89

In [65]:
df.groupby(by=['Class']).sum()
df

,School Num,Class,Sex,Name,English,Physics,Military,Maths,Algebra,Geometry,Computer
0,2308024241,23080242,M,"Chen, Long",76,78,77,40,23,60,89
1,2308024244,23080242,F,"Zhou, Yi",66,91,75,47,47,44,82
2,2308024251,23080242,M,Zhang， Bo,85,81,75,45,45,60,80
3,2308024249,23080242,M,"Zhu, Hao",65,50,80,72,62,71,82
4,2308024219,23080242,F,"Feng, Yin",73,88,92,61,47,46,83
5,2308024201,23080242,M,"Chi, Pei",60,50,89,71,76,71,82
6,2308024347,23080243,F,"Li, Hua",67,61,84,61,65,78,83
7,2308024307,23080243,M,"Chen, Ten",76,79,86,69,40,69,82
8,2308024226,23080243,M,"Yu, Hao",66,67,85,65,61,71,95
9,2308024220,23080243,F,"Li, Jia",62,60,90,60,67,7,95
10,2308024242,23080243,M,"Li, Shang Chu",76,90,84,60,66,60,82
11,2308024210,23080243,F,"Guo, Yi",79,67,84,64,64,79,85
12,2308024435,23080244,M,"Jiang, Yi Tao",77,71,71,87,61,73,76
13,2308024432,23080244,M,"Zhao, Yu",74,74,74,88,68,70,71
14,2308024446,23080244,F,"Zhou, Lu",76,80,77,61,74,80,85
15,2308024421,23080244,M,"Lin, Jian Xian",73,72,81,63,90,75,85
16,2308024433,23080244,M,"Li, Da Qiang",79,76,77,78,70,70,89
17,2308024428,23080244,M,"Li, Che Tong",64,96,91,69,60,77,83
18,2308024402,23080244,F,"Wang, hui",73,74,93,70,71,75,88
19,2308024422,23080244,M,"Li, Xiao Liang",85,60,85,72,72,83,89

In [66]:
df.groupby(by=['Class','Sex']).sum()
df

,School Num,Class,Sex,Name,English,Physics,Military,Maths,Algebra,Geometry,Computer
0,2308024241,23080242,M,"Chen, Long",76,78,77,40,23,60,89
1,2308024244,23080242,F,"Zhou, Yi",66,91,75,47,47,44,82
2,2308024251,23080242,M,Zhang， Bo,85,81,75,45,45,60,80
3,2308024249,23080242,M,"Zhu, Hao",65,50,80,72,62,71,82
4,2308024219,23080242,F,"Feng, Yin",73,88,92,61,47,46,83
5,2308024201,23080242,M,"Chi, Pei",60,50,89,71,76,71,82
6,2308024347,23080243,F,"Li, Hua",67,61,84,61,65,78,83
7,2308024307,23080243,M,"Chen, Ten",76,79,86,69,40,69,82
8,2308024226,23080243,M,"Yu, Hao",66,67,85,65,61,71,95
9,2308024220,23080243,F,"Li, Jia",62,60,90,60,67,7,95
10,2308024242,23080243,M,"Li, Shang Chu",76,90,84,60,66,60,82
11,2308024210,23080243,F,"Guo, Yi",79,67,84,64,64,79,85
12,2308024435,23080244,M,"Jiang, Yi Tao",77,71,71,87,61,73,76
13,2308024432,23080244,M,"Zhao, Yu",74,74,74,88,68,70,71
14,2308024446,23080244,F,"Zhou, Lu",76,80,77,61,74,80,85
15,2308024421,23080244,M,"Lin, Jian Xian",73,72,81,63,90,75,85
16,2308024433,23080244,M,"Li, Da Qiang",79,76,77,78,70,70,89
17,2308024428,23080244,M,"Li, Che Tong",64,96,91,69,60,77,83
18,2308024402,23080244,F,"Wang, hui",73,74,93,70,71,75,88
19,2308024422,23080244,M,"Li, Xiao Liang",85,60,85,72,72,83,89

In [67]:
df.groupby(by=['Class','Sex'])['Military'].agg(['min','max'])

              min  max
Class    Sex
23080242 F     75   92
         M     75   89
23080243 F     84   90
         M     84   86
23080244 F     77   93
         M     71   91

In [68]:
df.groupby(by=['Class','Sex'])['Military'].agg(['min','max','sum','mean','var','std','size'])

              min  max  sum       mean         var        std  size
Class    Sex
23080242 F     75   92  167  83.500000  144.500000  12.020815     2
         M     75   89  321  80.250000   38.250000   6.184658     4
23080243 F     84   90  258  86.000000   12.000000   3.464102     3
         M     84   86  255  85.000000    1.000000   1.000000     3
23080244 F     77   93  170  85.000000  128.000000  11.313708     2
         M     71   91  479  79.833333   54.566667   7.386925     6

In [69]:
import  numpy as np
import pandas as pd
df1 = pd.read_excel('rz4.xls')
df1

,Unnamed: 0,School Num,Class,Sex,Name,English,Physics,Military,Maths,Algebra,Geometry,Computer
0,0,2308024241,23080242,M,"Chen, Long",76,78,77,40,23,60,89
1,1,2308024244,23080242,F,"Zhou, Yi",66,91,75,47,47,44,82
2,2,2308024251,23080242,M,Zhang， Bo,85,81,75,45,45,60,80
3,3,2308024249,23080242,M,"Zhu, Hao",65,50,80,72,62,71,82
4,4,2308024219,23080242,F,"Feng, Yin",73,88,92,61,47,46,83
5,5,2308024201,23080242,M,"Chi, Pei",60,50,89,71,76,71,82
6,6,2308024347,23080243,F,"Li, Hua",67,61,84,61,65,78,83
7,7,2308024307,23080243,M,"Chen, Ten",76,79,86,69,40,69,82
8,8,2308024226,23080243,M,"Yu, Hao",66,67,85,65,61,71,95
9,9,2308024220,23080243,F,"Li, Jia",62,60,90,60,67,7,95
10,10,2308024242,23080243,M,"Li, Shang Chu",76,90,84,60,66,60,82
11,11,2308024210,23080243,F,"Guo, Yi",79,67,84,64,64,79,85
12,12,2308024435,23080244,M,"Jiang, Yi Tao",77,71,71,87,61,73,76
13,13,2308024432,23080244,M,"Zhao, Yu",74,74,74,88,68,70,71
14,14,2308024446,23080244,F,"Zhou, Lu",76,80,77,61,74,80,85
15,15,2308024421,23080244,M,"Lin, Jian Xian",73,72,81,63,90,75,85
16,16,2308024433,23080244,M,"Li, Da Qiang",79,76,77,78,70,70,89
17,17,2308024428,23080244,M,"Li, Che Tong",64,96,91,69,60,77,83
18,18,2308024402,23080244,F,"Wang, hui",73,74,93,70,71,75,88
19,19,2308024422,23080244,M,"Li, Xiao Liang",85,60,85,72,72,83,89

In [70]:
del df1["Unnamed: 0"]
df

,School Num,Class,Sex,Name,English,Physics,Military,Maths,Algebra,Geometry,Computer
0,2308024241,23080242,M,"Chen, Long",76,78,77,40,23,60,89
1,2308024244,23080242,F,"Zhou, Yi",66,91,75,47,47,44,82
2,2308024251,23080242,M,Zhang， Bo,85,81,75,45,45,60,80
3,2308024249,23080242,M,"Zhu, Hao",65,50,80,72,62,71,82
4,2308024219,23080242,F,"Feng, Yin",73,88,92,61,47,46,83
5,2308024201,23080242,M,"Chi, Pei",60,50,89,71,76,71,82
6,2308024347,23080243,F,"Li, Hua",67,61,84,61,65,78,83
7,2308024307,23080243,M,"Chen, Ten",76,79,86,69,40,69,82
8,2308024226,23080243,M,"Yu, Hao",66,67,85,65,61,71,95
9,2308024220,23080243,F,"Li, Jia",62,60,90,60,67,7,95
10,2308024242,23080243,M,"Li, Shang Chu",76,90,84,60,66,60,82
11,2308024210,23080243,F,"Guo, Yi",79,67,84,64,64,79,85
12,2308024435,23080244,M,"Jiang, Yi Tao",77,71,71,87,61,73,76
13,2308024432,23080244,M,"Zhao, Yu",74,74,74,88,68,70,71
14,2308024446,23080244,F,"Zhou, Lu",76,80,77,61,74,80,85
15,2308024421,23080244,M,"Lin, Jian Xian",73,72,81,63,90,75,85
16,2308024433,23080244,M,"Li, Da Qiang",79,76,77,78,70,70,89
17,2308024428,23080244,M,"Li, Che Tong",64,96,91,69,60,77,83
18,2308024402,23080244,F,"Wang, hui",73,74,93,70,71,75,88
19,2308024422,23080244,M,"Li, Xiao Liang",85,60,85,72,72,83,89

In [71]:
df1.sum

<bound method NDFrame._add_numeric_operations.<locals>.sum of     School Num     Class Sex            Name  English  Physics  Military  \
0   2308024241  23080242   M      Chen, Long       76       78        77
1   2308024244  23080242   F        Zhou, Yi       66       91        75
2   2308024251  23080242   M       Zhang， Bo       85       81        75
3   2308024249  23080242   M        Zhu, Hao       65       50        80
4   2308024219  23080242   F       Feng, Yin       73       88        92
5   2308024201  23080242   M        Chi, Pei       60       50        89
6   2308024347  23080243   F         Li, Hua       67       61        84
7   2308024307  23080243   M       Chen, Ten       76       79        86
8   2308024226  23080243   M         Yu, Hao       66       67        85
9   2308024220  23080243   F         Li, Jia       62       60        90
10  2308024242  23080243   M   Li, Shang Chu       76       90        84
11  2308024210  23080243   F         Guo, Yi       79       67        84
12  2308024435  23080244   M   Jiang, Yi Tao       77       71        71
13  2308024432  23080244   M        Zhao, Yu       74       74        74
14  2308024446  23080244   F        Zhou, Lu       76       80        77
15  2308024421  23080244   M  Lin, Jian Xian       73       72        81
16  2308024433  23080244   M    Li, Da Qiang       79       76        77
17  2308024428  23080244   M    Li, Che Tong       64       96        91
18  2308024402  23080244   F       Wang, hui       73       74        93
19  2308024422  23080244   M  Li, Xiao Liang       85       60        85

    Maths  Algebra  Geometry  Computer
0      40       23        60        89
1      47       47        44        82
2      45       45        60        80
3      72       62        71        82
4      61       47        46        83
5      71       76        71        82
6      61       65        78        83
7      69       40        69        82
8      65       61        71        95
9      60       67         7        95
10     60       66        60        82
11     64       64        79        85
12     87       61        73        76
13     88       68        70        71
14     61       74        80        85
15     63       90        75        85
16     78       70        70        89
17     69       60        77        83
18     70       71        75        88
19     72       72        83        89  >

In [72]:
df1 = pd.read_excel('rz2.xls')
df1

    Unnamed: 0       YHM         TCSJ          YWXT               IP
0            0  S1402048  18922254812  1.225790e+17    221.205.98.55
1            1  S1411023  13522255003  1.225790e+17  183.184.226.205
2            2  S1402048  13422259938           NaN    221.205.98.55
3            3  20031509  18822256753           NaN    222.31.51.200
4            4  S1405010  13422259313  1.225790e+17     120.207.64.3
5            5  20140007  13822254373  1.225790e+17    222.31.51.200
6            6  S1404095  13322252452  1.225790e+17    222.31.59.220
7            7  S1402048  18922257681  1.225790e+17    221.205.98.55
8            8  S1405011  13322252452  1.225790e+17   183.184.230.38
9            9  S1402048  18922253721  1.225790e+17    221.205.98.55
10          10  S1405011  18922257681  1.225790e+17   183.184.230.38

In [73]:
del df1["Unnamed: 0"]
df1

         YHM         TCSJ          YWXT               IP
0   S1402048  18922254812  1.225790e+17    221.205.98.55
1   S1411023  13522255003  1.225790e+17  183.184.226.205
2   S1402048  13422259938           NaN    221.205.98.55
3   20031509  18822256753           NaN    222.31.51.200
4   S1405010  13422259313  1.225790e+17     120.207.64.3
5   20140007  13822254373  1.225790e+17    222.31.51.200
6   S1404095  13322252452  1.225790e+17    222.31.59.220
7   S1402048  18922257681  1.225790e+17    221.205.98.55
8   S1405011  13322252452  1.225790e+17   183.184.230.38
9   S1402048  18922253721  1.225790e+17    221.205.98.55
10  S1405011  18922257681  1.225790e+17   183.184.230.38

In [74]:
df2 = pd.read_excel('rz3.xls')
df2

   Unnamed: 0       YHM         TCSJ          YWXT               IP
0           0  S1402011  18603514812  1.225790e+17    221.205.98.55
1           1  S1411022  13103515003  1.225790e+17  183.184.226.205
2           2  S1402033  13203559930           NaN    221.205.98.55

In [75]:
del df2["Unnamed: 0"]
df2

        YHM         TCSJ          YWXT               IP
0  S1402011  18603514812  1.225790e+17    221.205.98.55
1  S1411022  13103515003  1.225790e+17  183.184.226.205
2  S1402033  13203559930           NaN    221.205.98.55

In [76]:
import pandas as pd
df12 = pd.concat([df1,df2])
df12

         YHM         TCSJ          YWXT               IP
0   S1402048  18922254812  1.225790e+17    221.205.98.55
1   S1411023  13522255003  1.225790e+17  183.184.226.205
2   S1402048  13422259938           NaN    221.205.98.55
3   20031509  18822256753           NaN    222.31.51.200
4   S1405010  13422259313  1.225790e+17     120.207.64.3
5   20140007  13822254373  1.225790e+17    222.31.51.200
6   S1404095  13322252452  1.225790e+17    222.31.59.220
7   S1402048  18922257681  1.225790e+17    221.205.98.55
8   S1405011  13322252452  1.225790e+17   183.184.230.38
9   S1402048  18922253721  1.225790e+17    221.205.98.55
10  S1405011  18922257681  1.225790e+17   183.184.230.38
0   S1402011  18603514812  1.225790e+17    221.205.98.55
1   S1411022  13103515003  1.225790e+17  183.184.226.205
2   S1402033  13203559930           NaN    221.205.98.55

In [77]:
df13 = pd.concat([df1,df2],ignore_index=True)
df13

         YHM         TCSJ          YWXT               IP
0   S1402048  18922254812  1.225790e+17    221.205.98.55
1   S1411023  13522255003  1.225790e+17  183.184.226.205
2   S1402048  13422259938           NaN    221.205.98.55
3   20031509  18822256753           NaN    222.31.51.200
4   S1405010  13422259313  1.225790e+17     120.207.64.3
5   20140007  13822254373  1.225790e+17    222.31.51.200
6   S1404095  13322252452  1.225790e+17    222.31.59.220
7   S1402048  18922257681  1.225790e+17    221.205.98.55
8   S1405011  13322252452  1.225790e+17   183.184.230.38
9   S1402048  18922253721  1.225790e+17    221.205.98.55
10  S1405011  18922257681  1.225790e+17   183.184.230.38
11  S1402011  18603514812  1.225790e+17    221.205.98.55
12  S1411022  13103515003  1.225790e+17  183.184.226.205
13  S1402033  13203559930           NaN    221.205.98.55

In [78]:
import pandas as pd
from pandas import DataFrame

df = pd.read_csv('rz4.csv',sep=',',names=['band','area','num'])
df

        band   area    num
NaN     band   area    num
0.0      189   2225   4812
1.0      135   2225   5003
2.0      134   2225   9938
3.0      188   2225   6753
4.0      189   2225   3721
5.0      134   2225   9313
6.0      138   2225   4373
7.0      133   2225   2452
8.0      189   2225   7681

In [79]:
df.drop(df.index[0])

     band   area    num
0.0   189   2225   4812
1.0   135   2225   5003
2.0   134   2225   9938
3.0   188   2225   6753
4.0   189   2225   3721
5.0   134   2225   9313
6.0   138   2225   4373
7.0   133   2225   2452
8.0   189   2225   7681

In [80]:
df  = pd.read_csv('rz4.csv',sep=",")
df

   Unnamed: 0     band   area   num
0         189     2225   4812   NaN
1         135     2225   5003   NaN
2         134     2225   9938   NaN
3         188     2225   6753   NaN
4         189     2225   3721   NaN
5         134     2225   9313   NaN
6         138     2225   4373   NaN
7         133     2225   2452   NaN
8         189     2225   7681   NaN

In [81]:
df.keys()

Index(['Unnamed: 0', '   band', ' area', ' num'], dtype='object')

In [82]:
del df[" num"]
df

   Unnamed: 0     band   area
0         189     2225   4812
1         135     2225   5003
2         134     2225   9938
3         188     2225   6753
4         189     2225   3721
5         134     2225   9313
6         138     2225   4373
7         133     2225   2452
8         189     2225   7681

In [83]:
df.columns = ['band','area','num']
df

   band  area   num
0   189  2225  4812
1   135  2225  5003
2   134  2225  9938
3   188  2225  6753
4   189  2225  3721
5   134  2225  9313
6   138  2225  4373
7   133  2225  2452
8   189  2225  7681

In [84]:
df = df.astype(str)
df

  band  area   num
0  189  2225  4812
1  135  2225  5003
2  134  2225  9938
3  188  2225  6753
4  189  2225  3721
5  134  2225  9313
6  138  2225  4373
7  133  2225  2452
8  189  2225  7681

In [85]:
tel = df['band']+df['area']+df['num']
tel

0    18922254812
1    13522255003
2    13422259938
3    18822256753
4    18922253721
5    13422259313
6    13822254373
7    13322252452
8    18922257681
dtype: object

In [86]:
df1 = pd.read_excel('ry1.xls')
df1

   Unnamed: 0  id  band  num
0           0   1   130  123
1           1   2   131  124
2           2   4   133  125
3           3   5   134  126

In [87]:
df2 = pd.read_excel('ry2.xls')
df2

   Unnamed: 0  id  band  area
0           0   1   130   351
1           1   2   131   352
2           2   3   132   353
3           3   4   133   354
4           4   5   134   355
5           5   5   135   356

In [88]:
pd.merge(df1,df2,left_on= 'id',right_on='id')

   Unnamed: 0_x  id  band_x  num  Unnamed: 0_y  band_y  area
0             0   1     130  123             0     130   351
1             1   2     131  124             1     131   352
2             2   4     133  125             3     133   354
3             3   5     134  126             4     134   355
4             3   5     134  126             5     135   356

In [89]:
df = pd.read_csv('rz2.csv')
df

      id   band   num   price  Unnamed: 4
0      1    130   123     159         NaN
1      2    131   124     753         NaN
2      3    132   125     456         NaN
3      4    133   126     852         NaN

In [90]:
del df["Unnamed: 4"]
df

      id   band   num   price
0      1    130   123     159
1      2    131   124     753
2      3    132   125     456
3      4    133   126     852

In [91]:
df = df.rename(columns={"  id":"id"," band":'band'," num":"num"," price":"price"})
result = df.price*df.num
result

0     19557
1     93372
2     57000
3    107352
dtype: int64

In [92]:
df.price

0    159
1    753
2    456
3    852
Name: price, dtype: int64

In [93]:
df["result"] = result
df

      id  band  num  price  result
0      1   130  123    159   19557
1      2   131  124    753   93372
2      3   132  125    456   57000
3      4   133  126    852  107352

In [94]:
df = pd.read_csv('rz2.csv',sep=',')
df

      id   band   num   price  Unnamed: 4
0      1    130   123     159         NaN
1      2    131   124     753         NaN
2      3    132   125     456         NaN
3      4    133   126     852         NaN

In [95]:
df.keys()

Index(['   id', ' band', ' num', ' price', 'Unnamed: 4'], dtype='object')

In [96]:
del df["Unnamed: 4"]
df.columns = ['id','band','num','price']
df

   id  band  num  price
0   1   130  123    159
1   2   131  124    753
2   3   132  125    456
3   4   133  126    852

In [97]:
scale = (df.price-df.price.mean())/(df.price.max()-df.price.min())
scale

0   -0.571429
1    0.285714
2   -0.142857
3    0.428571
Name: price, dtype: float64

In [98]:
bins = [min(df.price)-1,500,max(df.price)+1]
label = ["<500",">500"]
pd.cut(df.price,bins)

0    (158, 500]
1    (500, 853]
2    (158, 500]
3    (500, 853]
Name: price, dtype: category
Categories (2, interval[int64]): [(158, 500] < (500, 853]]

In [99]:
pd.cut(df.price,bins,right=False,labels = label)

0    <500
1    >500
2    <500
3    >500
Name: price, dtype: category
Categories (2, object): ['<500' < '>500']

In [100]:
df['label'] = pd.cut(df.price,bins,right=False,labels = label)
df

   id  band  num  price label
0   1   130  123    159  <500
1   2   131  124    753  >500
2   3   132  125    456  <500
3   4   133  126    852  >500

In [101]:
from pandas import to_datetime
df = pd.read_csv('rz3.csv',sep=',',encoding='utf8')
df

     num price year month date
0    0 123 159 2016 1 2016/6/1
1    1 124 753 2016 2 2016/6/2
2    2 125 456 2016 3 2016/6/3
3    3 126 852 2016 4 2016/6/4
4    4 127 210 2016 5 2016/6/5
5    5 115 299 2016 6 2016/6/6
6    6 102 699 2016 7 2016/6/7
7    7 201 599 2016 8 2016/6/8
8    8 154 199 2016 9 2016/6/9
9  9 142 899 2016 10 2016/6/10

In [102]:
df = pd.read_csv('rz3.csv',delim_whitespace=True,encoding='utf8')
df

   num  price  year  month       date
0  123    159  2016      1   2016/6/1
1  124    753  2016      2   2016/6/2
2  125    456  2016      3   2016/6/3
3  126    852  2016      4   2016/6/4
4  127    210  2016      5   2016/6/5
5  115    299  2016      6   2016/6/6
6  102    699  2016      7   2016/6/7
7  201    599  2016      8   2016/6/8
8  154    199  2016      9   2016/6/9
9  142    899  2016     10  2016/6/10

In [103]:
df_dt = pd.to_datetime(df.date,format="%Y/%m/%d")
df_dt

0   2016-06-01
1   2016-06-02
2   2016-06-03
3   2016-06-04
4   2016-06-05
5   2016-06-06
6   2016-06-07
7   2016-06-08
8   2016-06-09
9   2016-06-10
Name: date, dtype: datetime64[ns]

In [104]:
df_dt.dt.year

0    2016
1    2016
2    2016
3    2016
4    2016
5    2016
6    2016
7    2016
8    2016
9    2016
Name: date, dtype: int64

In [105]:
df_dt.dt.day

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: date, dtype: int64

In [106]:
df = pd.read_excel('rz4.xls')
del df ["Unnamed: 0"]
df

,School Num,Class,Sex,Name,English,Physics,Military,Maths,Algebra,Geometry,Computer
0,2308024241,23080242,M,"Chen, Long",76,78,77,40,23,60,89
1,2308024244,23080242,F,"Zhou, Yi",66,91,75,47,47,44,82
2,2308024251,23080242,M,Zhang， Bo,85,81,75,45,45,60,80
3,2308024249,23080242,M,"Zhu, Hao",65,50,80,72,62,71,82
4,2308024219,23080242,F,"Feng, Yin",73,88,92,61,47,46,83
5,2308024201,23080242,M,"Chi, Pei",60,50,89,71,76,71,82
6,2308024347,23080243,F,"Li, Hua",67,61,84,61,65,78,83
7,2308024307,23080243,M,"Chen, Ten",76,79,86,69,40,69,82
8,2308024226,23080243,M,"Yu, Hao",66,67,85,65,61,71,95
9,2308024220,23080243,F,"Li, Jia",62,60,90,60,67,7,95
10,2308024242,23080243,M,"Li, Shang Chu",76,90,84,60,66,60,82
11,2308024210,23080243,F,"Guo, Yi",79,67,84,64,64,79,85
12,2308024435,23080244,M,"Jiang, Yi Tao",77,71,71,87,61,73,76
13,2308024432,23080244,M,"Zhao, Yu",74,74,74,88,68,70,71
14,2308024446,23080244,F,"Zhou, Lu",76,80,77,61,74,80,85
15,2308024421,23080244,M,"Lin, Jian Xian",73,72,81,63,90,75,85
16,2308024433,23080244,M,"Li, Da Qiang",79,76,77,78,70,70,89
17,2308024428,23080244,M,"Li, Che Tong",64,96,91,69,60,77,83
18,2308024402,23080244,F,"Wang, hui",73,74,93,70,71,75,88
19,2308024422,23080244,M,"Li, Xiao Liang",85,60,85,72,72,83,89

In [107]:
import  numpy as np
df.groupby(by=['Class','Sex'])['Military'].agg([np.sum,np.size,np.mean,np.var,np.std,np.max,np.min])

              sum  size       mean         var        std  amax  amin
Class    Sex
23080242 F    167     2  83.500000  144.500000  12.020815    92    75
         M    321     4  80.250000   38.250000   6.184658    89    75
23080243 F    258     3  86.000000   12.000000   3.464102    90    84
         M    255     3  85.000000    1.000000   1.000000    86    84
23080244 F    170     2  85.000000  128.000000  11.313708    93    77
         M    479     6  79.833333   54.566667   7.386925    91    71

In [108]:
Total = df.English+df.Physics+df.Military+df.Maths+df.Algebra+df.Computer+df.Geometry
Total

0     443
1     452
2     471
3     482
4     490
5     499
6     499
7     501
8     510
9     441
10    518
11    522
12    516
13    519
14    533
15    539
16    539
17    540
18    544
19    546
dtype: int64

In [109]:
df['Total'] = Total
df

,School Num,Class,Sex,Name,English,Physics,Military,Maths,Algebra,Geometry,Computer,Total
0,2308024241,23080242,M,"Chen, Long",76,78,77,40,23,60,89,443
1,2308024244,23080242,F,"Zhou, Yi",66,91,75,47,47,44,82,452
2,2308024251,23080242,M,Zhang， Bo,85,81,75,45,45,60,80,471
3,2308024249,23080242,M,"Zhu, Hao",65,50,80,72,62,71,82,482
4,2308024219,23080242,F,"Feng, Yin",73,88,92,61,47,46,83,490
5,2308024201,23080242,M,"Chi, Pei",60,50,89,71,76,71,82,499
6,2308024347,23080243,F,"Li, Hua",67,61,84,61,65,78,83,499
7,2308024307,23080243,M,"Chen, Ten",76,79,86,69,40,69,82,501
8,2308024226,23080243,M,"Yu, Hao",66,67,85,65,61,71,95,510
9,2308024220,23080243,F,"Li, Jia",62,60,90,60,67,7,95,441
10,2308024242,23080243,M,"Li, Shang Chu",76,90,84,60,66,60,82,518
11,2308024210,23080243,F,"Guo, Yi",79,67,84,64,64,79,85,522
12,2308024435,23080244,M,"Jiang, Yi Tao",77,71,71,87,61,73,76,516
13,2308024432,23080244,M,"Zhao, Yu",74,74,74,88,68,70,71,519
14,2308024446,23080244,F,"Zhou, Lu",76,80,77,61,74,80,85,533
15,2308024421,23080244,M,"Lin, Jian Xian",73,72,81,63,90,75,85,539
16,2308024433,23080244,M,"Li, Da Qiang",79,76,77,78,70,70,89,539
17,2308024428,23080244,M,"Li, Che Tong",64,96,91,69,60,77,83,540
18,2308024402,23080244,F,"Wang, hui",73,74,93,70,71,75,88,544
19,2308024422,23080244,M,"Li, Xiao Liang",85,60,85,72,72,83,89,546

In [110]:
bins = [min(df.Total)-1,450,500,max(df.Total)+1]
labels = ['<450','450-500','>500']
Total_1 = pd.cut(df.Total,bins,labels=labels)
Total_1

0        <450
1     450-500
2     450-500
3     450-500
4     450-500
5     450-500
6     450-500
7        >500
8        >500
9        <450
10       >500
11       >500
12       >500
13       >500
14       >500
15       >500
16       >500
17       >500
18       >500
19       >500
Name: Total, dtype: category
Categories (3, object): ['<450' < '450-500' < '>500']

In [111]:
df['Category'] = Total_1
df

,School Num,Class,Sex,Name,English,Physics,Military,Maths,Algebra,Geometry,Computer,Total,Category
0,2308024241,23080242,M,"Chen, Long",76,78,77,40,23,60,89,443,<450
1,2308024244,23080242,F,"Zhou, Yi",66,91,75,47,47,44,82,452,450-500
2,2308024251,23080242,M,Zhang， Bo,85,81,75,45,45,60,80,471,450-500
3,2308024249,23080242,M,"Zhu, Hao",65,50,80,72,62,71,82,482,450-500
4,2308024219,23080242,F,"Feng, Yin",73,88,92,61,47,46,83,490,450-500
5,2308024201,23080242,M,"Chi, Pei",60,50,89,71,76,71,82,499,450-500
6,2308024347,23080243,F,"Li, Hua",67,61,84,61,65,78,83,499,450-500
7,2308024307,23080243,M,"Chen, Ten",76,79,86,69,40,69,82,501,>500
8,2308024226,23080243,M,"Yu, Hao",66,67,85,65,61,71,95,510,>500
9,2308024220,23080243,F,"Li, Jia",62,60,90,60,67,7,95,441,<450
10,2308024242,23080243,M,"Li, Shang Chu",76,90,84,60,66,60,82,518,>500
11,2308024210,23080243,F,"Guo, Yi",79,67,84,64,64,79,85,522,>500
12,2308024435,23080244,M,"Jiang, Yi Tao",77,71,71,87,61,73,76,516,>500
13,2308024432,23080244,M,"Zhao, Yu",74,74,74,88,68,70,71,519,>500
14,2308024446,23080244,F,"Zhou, Lu",76,80,77,61,74,80,85,533,>500
15,2308024421,23080244,M,"Lin, Jian Xian",73,72,81,63,90,75,85,539,>500
16,2308024433,23080244,M,"Li, Da Qiang",79,76,77,78,70,70,89,539,>500
17,2308024428,23080244,M,"Li, Che Tong",64,96,91,69,60,77,83,540,>500
18,2308024402,23080244,F,"Wang, hui",73,74,93,70,71,75,88,544,>500
19,2308024422,23080244,M,"Li, Xiao Liang",85,60,85,72,72,83,89,546,>500

In [112]:
df.groupby(by=["Category"])['Total'].agg('size')

Category
<450        2
450-500     6
>500       12
Name: Total, dtype: int64